/*Выведите в консоль все целые числа от 1 до 100.*/
/*
let a = 0
for( let i=0;i<100;i++){
   console.log(a)
   a++;
   
}*/

/*Выведите в консоль все целые числа от -100 до 0.*/
/*let a = -101;
for(let i=0;i<100;i++){
   a++;
   console.log(a)
}*/

/*Выведите в консоль все целые числа от 100 до 1.*/
/*
let a =100;
for(let i=0;i<100;i++){
   console.log(a)
   a--;
}*/

/*Выведите в консоль все четные числа из промежутка от 1 до 100.*/
/*
let a=0
for(let i=0;i<=100;i++){
   if(a%2==0)
  console.log(a)
   a++
}*/

/*Выведите в консоль все числа кратные трем в промежутке от 1 до 100.*/
/*
let a=0
for(let i=0;i<100;i++){
   if(i%3==0)
   console.log(a)
   a++;
}
*/
/*const numbers=
[...Array(100).keys()].filter(num => num%3===0);
console.log(numbers)*/






